
## Terraform plan for environment: `prep`

**Commit:** c7f30f0c0a53a26c660bba6997d8af1c73a1264d


**API version:** bdaef45c2b
**CLI version:** bdaef45c2b
**Selfserve version:** bdaef45c2b
**Internal version:** bdaef45c2b

### Plan summary

`9 to add, 89 to change, 1 to destroy`

**🆕 Creates**

```tf
module.service.aws_lb_listener_rule.renderer-batch["pdf-converter"]
module.service.aws_lb_listener_rule.this["pdf-converter"]
module.service.module.ecs_service["api"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["pdf-converter"].aws_appautoscaling_policy.this["cpu"]
module.service.module.ecs_service["pdf-converter"].aws_appautoscaling_policy.this["memory"]
module.service.module.ecs_service["pdf-converter"].aws_appautoscaling_target.this[0]
module.service.module.ecs_service["pdf-converter"].aws_ecs_service.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_task_definition.this[0]
```
**🗑️ Deletes**

```tf
null_resource.deployed_versions
```
**📖 Reads**

```tf
module.service.module.ecs_service["api"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].data.aws_ecs_task_definition.this[0]
module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0]
```
**🔄 Updates**

```tf
module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"]
module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"]
module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"]
module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"]
module.service.module.batch.aws_batch_job_definition.this["cns"]
module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"]
module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"]
module.service.module.batch.aws_batch_job_definition.this["database-maintenance"]
module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"]
module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-removal"]
module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"]
module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"]
module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"]
module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"]
module.service.module.batch.aws_batch_job_definition.this["import-anondb"]
module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"]
module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"]
module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"]
module.service.module.batch.aws_batch_job_definition.this["international-goods-export"]
module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"]
module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"]
module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"]
module.service.module.batch.aws_batch_job_definition.this["ni-compliance"]
module.service.module.batch.aws_batch_job_definition.this["populate-anondb"]
module.service.module.batch.aws_batch_job_definition.this["process-cl"]
module.service.module.batch.aws_batch_job_definition.this["process-company-profile"]
module.service.module.batch.aws_batch_job_definition.this["process-inbox"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"]
module.service.module.batch.aws_batch_job_definition.this["process-ntu"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-community-licences"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-ecmt-accept"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-general"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-irhp-allocate"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-print"]
module.service.module.batch.aws_batch_job_definition.this["psv-operator-list-export"]
module.service.module.batch.aws_batch_job_definition.this["remove-read-audit"]
module.service.module.batch.aws_batch_job_definition.this["resolve-payments"]
module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"]
module.service.module.batch.aws_batch_job_definition.this["system-parameter"]
module.service.module.batch.aws_batch_job_definition.this["transxchange-consumer"]
module.service.module.cloudfront.aws_cloudfront_distribution.this[0]
module.service.module.ecs_service["api"].aws_ecs_service.this[0]
module.service.module.ecs_service["internal"].aws_ecs_service.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0]
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-clean-up-variations-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-close-expired-windows-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-cns-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-company-profile-dlq-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-create-psv-licence-surrender-task-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-digital-continuation-reminders-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-duplicate-vehicle-removal-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-duplicate-vehicle-warning-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-enqueue-ch-compare-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-expire-bus-registration-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-flag-urgent-tasks-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-inspection-request-email-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-interim-end-date-enforcement-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-international-goods-export-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-last-tm-letter-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-licence-status-rules-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-mark-expired-permits-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-company-profile-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-inbox-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-insolvency-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-insolvency-dlq-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-ntu-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-community-licences-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-disc-generation-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-disc-print-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-ecmt-accept-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-general-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-irhp-allocate-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-permit-generation-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-permit-print-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-print-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-psv-operator-list-export-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-remove-read-audit-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-resolve-payments-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-transxchange-consumer-0"]
```


----

<details data-gh-workflow="prep-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # null_resource.deployed_versions must be replaced
-/+ resource "null_resource" "deployed_versions" {
      ~ id       = "6511388354976915912" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "deployed_api_image_tag"       = "release-v6.3.0" -> "bdaef45c2b"
          ~ "deployed_assets_version"      = "release-v6.3.0" -> "release-v6.2.0"
          ~ "deployed_cli_image_tag"       = "release-v6.3.0" -> "bdaef45c2b"
          ~ "deployed_internal_image_tag"  = "release-v6.3.0" -> "bdaef45c2b"
          ~ "deployed_selfserve_image_tag" = "release-v6.3.0" -> "bdaef45c2b"
        }
    }

  # module.service.aws_lb_listener_rule.renderer-batch["pdf-converter"] will be created
  + resource "aws_lb_listener_rule" "renderer-batch" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:listener/app/APPPP-OLCS-PRI-SVCS-ALB/708b9e321e09651c/72b340b1c43c2500"
      + priority     = 87
      + tags_all     = {
          + "Environment" = "prep"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:targetgroup/vol-app-prep-pdf-converter-tg/3e4867cd8e4a9ec5"
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "renderer.*",
                ]
            }
        }
      + condition {
          + source_ip {
              + values = [
                  + "10.174.148.144/28",
                  + "10.174.148.160/28",
                  + "10.174.148.176/28",
                ]
            }
        }
    }

  # module.service.aws_lb_listener_rule.this["pdf-converter"] will be created
  + resource "aws_lb_listener_rule" "this" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:listener/app/APPPP-OLCS-PRI-SVCS-ALB/708b9e321e09651c/72b340b1c43c2500"
      + priority     = 5
      + tags_all     = {
          + "Environment" = "prep"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:targetgroup/vol-app-prep-pdf-converter-tg/3e4867cd8e4a9ec5"
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "renderer.*",
                ]
            }
        }
      + condition {
          + source_ip {
              + values = [
                  + "10.174.144.64/28",
                  + "10.174.144.80/28",
                  + "10.174.144.96/28",
                ]
            }
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cancel-unsubmitted-bilateral:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cancel-unsubmitted-bilateral:63"
        name                       = "vol-app-prep-cancel-unsubmitted-bilateral"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ch-vs-olcs-diffs:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ch-vs-olcs-diffs:63"
        name                       = "vol-app-prep-ch-vs-olcs-diffs"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-clean-up-variations:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-clean-up-variations:63"
        name                       = "vol-app-prep-clean-up-variations"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-close-expired-windows:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-close-expired-windows:63"
        name                       = "vol-app-prep-close-expired-windows"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["cns"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cns:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cns:63"
        name                       = "vol-app-prep-cns"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-company-profile-dlq:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-company-profile-dlq:63"
        name                       = "vol-app-prep-company-profile-dlq"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-create-psv-licence-surrender-task:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-create-psv-licence-surrender-task:63"
        name                       = "vol-app-prep-create-psv-licence-surrender-task"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-delete:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-delete:63"
        name                       = "vol-app-prep-data-retention-delete"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-populate:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-populate:63"
        name                       = "vol-app-prep-data-retention-populate"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-postcheck:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-postcheck:63"
        name                       = "vol-app-prep-data-retention-postcheck"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-precheck:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-precheck:63"
        name                       = "vol-app-prep-data-retention-precheck"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["database-maintenance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-database-maintenance:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-database-maintenance:63"
        name                       = "vol-app-prep-database-maintenance"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-digital-continuation-reminders:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-digital-continuation-reminders:63"
        name                       = "vol-app-prep-digital-continuation-reminders"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-removal"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-removal:6" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-removal:6"
        name                       = "vol-app-prep-duplicate-vehicle-removal"
      ~ revision                   = 6 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-warning:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-warning:63"
        name                       = "vol-app-prep-duplicate-vehicle-warning"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-enqueue-ch-compare:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-enqueue-ch-compare:63"
        name                       = "vol-app-prep-enqueue-ch-compare"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-expire-bus-registration:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-expire-bus-registration:63"
        name                       = "vol-app-prep-expire-bus-registration"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-flag-urgent-tasks:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-flag-urgent-tasks:63"
        name                       = "vol-app-prep-flag-urgent-tasks"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-anondb:69" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.3.0"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "bdaef45c2b"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-anondb:69"
        name                       = "vol-app-prep-import-anondb"
      ~ revision                   = 69 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-users-from-csv:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-users-from-csv:63"
        name                       = "vol-app-prep-import-users-from-csv"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-inspection-request-email:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-inspection-request-email:63"
        name                       = "vol-app-prep-inspection-request-email"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-interim-end-date-enforcement:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-interim-end-date-enforcement:63"
        name                       = "vol-app-prep-interim-end-date-enforcement"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["international-goods-export"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-international-goods-export:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-international-goods-export:63"
        name                       = "vol-app-prep-international-goods-export"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-last-tm-letter:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-last-tm-letter:63"
        name                       = "vol-app-prep-last-tm-letter"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-licence-status-rules:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-licence-status-rules:63"
        name                       = "vol-app-prep-licence-status-rules"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-mark-expired-permits:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-mark-expired-permits:63"
        name                       = "vol-app-prep-mark-expired-permits"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ni-compliance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ni-compliance:69" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.3.0"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "bdaef45c2b"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ni-compliance:69"
        name                       = "vol-app-prep-ni-compliance"
      ~ revision                   = 69 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["populate-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-populate-anondb:69" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.3.0"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "bdaef45c2b"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-populate-anondb:69"
        name                       = "vol-app-prep-populate-anondb"
      ~ revision                   = 69 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-cl"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-cl:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-cl:63"
        name                       = "vol-app-prep-process-cl"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-company-profile"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-company-profile:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-company-profile:63"
        name                       = "vol-app-prep-process-company-profile"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-inbox"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-inbox:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-inbox:63"
        name                       = "vol-app-prep-process-inbox"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-insolvency"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency:63"
        name                       = "vol-app-prep-process-insolvency"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency-dlq:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency-dlq:63"
        name                       = "vol-app-prep-process-insolvency-dlq"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-ntu"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-ntu:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.3.0" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "bdaef45c2b"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.3.0" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:bdaef45c2b"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes... (truncated, see full plan in the workflow run logs)
```

</details>